app/Models/Mahasiswa_model.php

    public function getAll()
    {
        return $this->orderBy('IdMhsw', 'ASC')->findAll();
---
SELECT *
FROM `mahasiswa`
ORDER BY `IdMhsw` ASC

    public function getById($id)
    {
        return $this->where(['IdMhsw' => $id])->first();
---
SELECT *
FROM `mahasiswa`
WHERE `IdMhsw` = '21'
 LIMIT 1